Ran Plan for dir: `terragrunt/staging/instances/vm-test-02` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02": 
time=2023-06-23T16:30:53Z level=warning msg=Versioning is not enabled for the remote state GCS bucket terraform-batch8. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.70.0"...
- Installing hashicorp/google v4.70.0...
- Installed hashicorp/google v4.70.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "vm-test-02"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "http-server",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "default"
          + subnetwork_project = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_ip = (known after apply)

Error: Invalid index

  on output.tf line 2, in output "public_ip":
   2:   value = google_compute_instance.default.network_interface.0.access_config.0.nat_ip
    ├────────────────
    │ google_compute_instance.default.network_interface[0].access_config is empty list of object

The given key does not identify an element in this collection value: the
collection has no elements.
time=2023-06-23T16:30:57Z level=error msg=Terraform invocation failed in /root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02/.terragrunt-cache/e5YJneJTZwBa0MxGIXSRyuFFeWU/mUPxhdKNodQPBXEgIqmi5ZW99YU/module/gcp/instances prefix=[/root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02] 
time=2023-06-23T16:30:57Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/abdulrobby/terraform-batch8/4/default/terragrunt/staging/instances/vm-test-02/.terragrunt-cache/e5YJneJTZwBa0MxGIXSRyuFFeWU/mUPxhdKNodQPBXEgIqmi5ZW99YU/module/gcp/instances] exit status 1




```
</details>